# 如何将多个小字符串拼接成一个大的字符串

# 解决方案
# 方法一: 迭代列表,连续使用 '+'操作依次拼接每一个字符串
pl = ["<0112>","<23>","<1024x768>","<60>","<1>","<100.0>","<500.0>"]

s = ''

for p in pl:
    s += p

print(s)
# <0112>
# <0112><23>
# <0112><23><1024x768>
# <0112><23><1024x768><60>
# <0112><23><1024x768><60><1>
# <0112><23><1024x768><60><1><100.0>
# <0112><23><1024x768><60><1><100.0><500.0>
# 很多空间被浪费了

# 方法二:使用 str.join() 方法,更加快速的拼接列表中所有字符串
# 推荐
print(''.join(pl))

# 说明一点,有些不是字符串


l = ['abc',123,45,'xyz']

print(''.join(str(x) for x in l))